venu-madhav-anyam/STM32/36_ADCBareMetal/Drivers/src/stm32l476xx_adc.c
/*
 * stm32l476xx_adc.c
 *
 *  Created on: May 11, 2026
 *      Author: Venu Madhav Anyam
 */

#include "stm32l476xx_adc.h"

static void delay_ms(uint8_t a) {
	for (volatile uint32_t i = 0; i < 100000 * a; i++)
		;
}

void ADC_PeriClockControl(ADC_TypeDef *pADCx, uint8_t EnOrDi) {
	if (EnOrDi == ENABLE) {
		if (pADCx == ADC1) {
			ADC1_CLK_ENABLE();
		}
	} else {
		if (pADCx == ADC1) {
			ADC1_CLK_DISABLE();
		}
	}
}

void ADC_Init(void) {
	/* Enable ADC clock */
	RCC->AHB2ENR |= (1 << 13);

	/* Enable HSI16 */
	RCC->CR |= (1 << 8);

	while (!(RCC->CR & (1 << 10)))
		;

	/* Exit deep-power-down */
	ADC1->CR &= ~(1 << 29);

	/* Enable regulator */
	ADC1->CR |= (1 << 28);

	/* Wait regulator startup */
	for (volatile uint32_t i = 0; i < 100000; i++) {
		__asm("nop");
	}

	/* ADC clock = HCLK/1 */
	ADC123_COMMON->CCR &= ~(3 << 16);
	ADC123_COMMON->CCR |= (1 << 16);

	/* Ensure ADC disabled */
	if (ADC1->CR & (1 << 0)) {
		ADC1->CR |= (1 << 1);

		while (ADC1->CR & (1 << 0))
			;
	}

	/* Wait calibration stop */
	while (ADC1->CR & (1 << 31))
		;

	/* =========================
	 CONFIGURE CHANNEL FIRST
	 ========================= */

	/* Single conversion */
	ADC1->CFGR &= ~(1 << 13);

	/* EOC after each conversion */
	ADC1->CFGR &= ~(1 << 10);

	/* Sequence length = 1 */
	ADC1->SQR1 &= ~(0xF << 0);

	/* Clear entire SQR1 */
	ADC1->SQR1 = 0;

	/* L = 0 -> 1 conversion */

	/* SQ1 = channel 5 */
	ADC1->SQR1 |= (5 << 6);

	/* Sampling time */
	ADC1->SMPR1 &= ~(7 << 15);
	ADC1->SMPR1 |= (7 << 15);

	/* Clear ADRDY */
	//ADC1->ISR |= (1 << 0);
	/* Enable ADC */
	ADC1->CR |= (1 << 0);

	/* Wait ready */
	while (!(ADC1->ISR & (1 << 0)))
		;
}

uint16_t ADC_Read(void)
{
    /* Clear EOC + EOS safely */
    //ADC1->ISR = (1 << 2) | (1 << 3);

    /* Start conversion */
    ADC1->CR |= (1 << 2);

    /* Wait EOC */
    while (!(ADC1->ISR & (1 << 2)));

    return (uint16_t)ADC1->DR;
}
